УНФ_ТЕСТ/src/AccumulationRegisters/РасчетыСПодотчетниками/РасчетыСПодотчетниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасчетыСПодотчетниками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаВал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СодержаниеПроводки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.РасходСоСчета</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.ПоступлениеВКассу</types>
      <types>DocumentRef.РасходИзКассы</types>
      <types>DocumentRef.ПоступлениеНаСчет</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УНФ_ТЕСТ/src/AccumulationRegisters/РасчетыСПодотчетниками/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура создает пустую временную таблицу изменения движений.
//
Процедура СоздатьПустуюВременнуюТаблицуИзменение(ДополнительныеСвойства) Экспорт
	
	Если НЕ ДополнительныеСвойства.Свойство("ДляПроведения")
	 ИЛИ НЕ ДополнительныеСвойства.ДляПроведения.Свойство("СтруктураВременныеТаблицы") Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 0
	|	РегистрНакопленияРасчетыСПодотчетниками.НомерСтроки КАК НомерСтроки,
	|	РегистрНакопленияРасчетыСПодотчетниками.Организация КАК Организация,
	|	РегистрНакопленияРасчетыСПодотчетниками.Сотрудник КАК Сотрудник,
	|	РегистрНакопленияРасчетыСПодотчетниками.Валюта КАК Валюта,
	|	РегистрНакопленияРасчетыСПодотчетниками.Документ КАК Документ,
	|	РегистрНакопленияРасчетыСПодотчетниками.Сумма КАК СуммаПередЗаписью,
	|	РегистрНакопленияРасчетыСПодотчетниками.Сумма КАК СуммаИзменение,
	|	РегистрНакопленияРасчетыСПодотчетниками.Сумма КАК СуммаПриЗаписи,
	|	РегистрНакопленияРасчетыСПодотчетниками.СуммаВал КАК СуммаВалПередЗаписью,
	|	РегистрНакопленияРасчетыСПодотчетниками.СуммаВал КАК СуммаВалИзменение,
	|	РегистрНакопленияРасчетыСПодотчетниками.СуммаВал КАК СуммаВалПриЗаписи
	|ПОМЕСТИТЬ ДвиженияРасчетыСПодотчетникамиИзменение
	|ИЗ
	|	РегистрНакопления.РасчетыСПодотчетниками КАК РегистрНакопленияРасчетыСПодотчетниками");
	
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураВременныеТаблицы.Вставить("ДвиженияРасчетыСПодотчетникамиИзменение", Ложь);
	
КонецПроцедуры // СоздатьПустуюВременнуюТаблицуИзменение()

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#КонецЕсли
